"Please Donate" = "Contribuisci";
"Donate" = "Dona";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Questo è un programma gratuito, ma comunque costa crearlo, mantenerlo e distribuirlo. Se sei contento di utilizzarlo, considera la possibilità di fare una donazione agli autori. Aiuterai a rendere Cyberduck ancora migliore!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Come contributore a Cyberduck riceverai una chiave di registrazione per disattivare questo messaggio.";
"Thank you for using Cyberduck!" = "Grazie per aver usato Cyberduck!";
"Later" = "Più tardi";
"Don't show again for this version" = "Non visualizzare più per questa versione";
"Registration Key" = "Chiave registrazione";

"Buy in Windows Store" = "Buy in Windows Store";
"Buy in Mac App Store" = "Buy in Mac App Store";

